```
michaelobrien@mbp7 modules % terraform plan                               
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "example-eks-cluster"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Name" = "eks-cluster"
        }
      + tags_all                  = {
          + "Name" = "eks-cluster"
        }
      + version                   = "1.31"

      + kubernetes_network_config (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.eks_node_group will be created
  + resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "example-eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "eks-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "my-node-group"
        }
      + tags_all               = {
          + "Name" = "my-node-group"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config (known after apply)
    }

  # aws_iam_role.eks_cluster_role will be created
  + resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.eks-cluster-AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks-cluster-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # aws_iam_role_policy_attachment.eks-node-AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "eks-node-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-cluster-role"
    }

  # aws_iam_role_policy_attachment.eks-node-AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks-node-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-cluster-role"
    }

  # aws_subnet.private_subnet_1 will be created
  + resource "aws_subnet" "private_subnet_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "eks-private-subnet-1"
        }
      + tags_all                                       = {
          + "Name" = "eks-private-subnet-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnet_2 will be created
  + resource "aws_subnet" "private_subnet_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "eks-private-subnet-2"
        }
      + tags_all                                       = {
          + "Name" = "eks-private-subnet-2"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.eks_vpc will be created
  + resource "aws_vpc" "eks_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "eks-vpc"
        }
      + tags_all                             = {
          + "Name" = "eks-vpc"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────
```

apply
```
Plan: 9 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_iam_role.eks_cluster_role: Creating...
aws_vpc.eks_vpc: Creating...
aws_iam_role.eks_cluster_role: Creation complete after 1s [id=eks-cluster-role]
aws_iam_role_policy_attachment.eks-node-AmazonEC2ContainerRegistryReadOnly: Creating...
aws_iam_role_policy_attachment.eks-cluster-AmazonEKSClusterPolicy: Creating...
aws_iam_role_policy_attachment.eks-node-AmazonEKSWorkerNodePolicy: Creating...
aws_iam_role_policy_attachment.eks-cluster-AmazonEKSClusterPolicy: Creation complete after 0s [id=eks-cluster-role-20241030022900957500000001]
aws_iam_role_policy_attachment.eks-node-AmazonEC2ContainerRegistryReadOnly: Creation complete after 0s [id=eks-cluster-role-20241030022901059500000002]
aws_iam_role_policy_attachment.eks-node-AmazonEKSWorkerNodePolicy: Creation complete after 0s [id=eks-cluster-role-20241030022901100500000003]
aws_vpc.eks_vpc: Creation complete after 2s [id=vpc-0b1cdd805dcb295a7]
aws_subnet.private_subnet_1: Creating...
aws_subnet.private_subnet_2: Creating...
aws_subnet.private_subnet_2: Creation complete after 1s [id=subnet-0b1864ff8053ea05f]
aws_subnet.private_subnet_1: Creation complete after 1s [id=subnet-068e4d3fe6ad6bf3f]
aws_eks_cluster.eks_cluster: Creating...
aws_eks_cluster.eks_cluster: Still creating... [10s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [20s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [30s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [40s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [50s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [1m0s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [1m10s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [1m20s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [1m30s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [1m40s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [1m50s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [2m0s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [2m10s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [2m20s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [2m30s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [2m40s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [2m50s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [3m0s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [3m10s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [3m20s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [3m30s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [3m40s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [3m50s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [4m0s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [4m10s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [4m20s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [4m30s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [4m40s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [4m50s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [5m0s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [5m10s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [5m20s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [5m30s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [5m40s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [5m50s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [6m0s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [6m10s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [6m20s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [6m30s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [6m40s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [6m50s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [7m0s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [7m10s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [7m20s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [7m30s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [7m40s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [7m50s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [8m0s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [8m10s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [8m20s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [8m30s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [8m40s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [8m50s elapsed]
aws_eks_cluster.eks_cluster: Still creating... [9m0s elapsed]
aws_eks_cluster.eks_cluster: Creation complete after 9m6s [id=example-eks-cluster]
aws_eks_node_group.eks_node_group: Creating...
╷
│ Error: creating EKS Node Group (example-eks-cluster:eks-node-group): InvalidParameterException: Following required service principals [ec2.amazonaws.com] were not found in the trust relationships of nodeRole arn:aws:iam::453279094200:role/eks-cluster-role
│ {
│   RespMetadata: {
│     StatusCode: 400,
│     RequestID: "e45c0b6f-5664-49f0-8382-e05c098be3a9"
│   },
│   ClusterName: "example-eks-cluster",
│   Message_: "Following required service principals [ec2.amazonaws.com] were not found in the trust relationships of nodeRole arn:aws:iam::453279094200:role/eks-cluster-role",
│   NodegroupName: "eks-node-group"
│ }
│ 
│   with aws_eks_node_group.eks_node_group,
│   on eks.tf line 119, in resource "aws_eks_node_group" "eks_node_group":
│  119: resource "aws_eks_node_group" "eks_node_group" {
│ 
╵

```